/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
        "padding_top": 28,
        "padding_bottom": 28
      }
    },
    "about_video_section_zCCfTg": {
      "type": "about-video-section",
      "name": "about video section",
      "settings": {
        "video_url": "https://cdn.shopify.com/videos/c/o/v/26aec6bb36b94f099a2dffceddbb1596.mp4",
        "subheading": "ABOUT",
        "heading": "SCRATCH HOUSE"
      }
    },
    "split_section_BUjQjr": {
      "type": "split-section",
      "name": "Split section",
      "settings": {
        "image": "shopify://shop_images/a397fa_1219f183b28f4d1a98dbca4215eb4d04_mv2.jpg",
        "heading": "ORIGINS OF SCRATCH HOUSE",
        "text": "One of the biggest challenges Chef Howe faced during his tenure at Donna Jean was the lack of vegan cheese options with the form and function to meet the needs of a professional kitchen. When they couldn’t find a suitable vegan Mozzarella for pizza on the Donna Jean menu, Chef Howe began binge researching and testing new creative methods and ingredients, determined to solve the problem himself. The success led to a new obsession, and Chef Howe set off on a journey of discovery, creating an ever growing menu of delicious and functional vegan cheeses, and specialty vegan provisions. Out of this passion side-project, Scratch House was born, and has now become a full time stand alone venture. The mission of Scratch House is to break the few remaining barriers of vegan elevated cuisine, using scrap ingredients and ‘ugly’ produce to bring everything traditionally found on a charcuterie board to veganism. In addition to Chef Howe, and Chef Roy Elam of Donna Jean, Scratch House also welcomes the talents of San Diego’s finest, including Zach Vouga from Plant Power Fast Food, and Mitch Wallis of Evolution Fast Food. Scratch House seeks to design a uniquely SoCal vegan experience, working together with other purveyors in the local farm, restaurant, and vegan communities to build a new sustainable, ethical, harm and waste free culinary world – from scratch."
      }
    },
    "split_section_reversed_jyJear": {
      "type": "split-section-reversed",
      "name": "Split section (Reversed)",
      "settings": {
        "image": "shopify://shop_images/a397fa_a1b52abd75124140a5e6a6a03c23c1dc_mv2.avif",
        "heading": "ABOUT CHEF TONY",
        "text": "ABOUT CHEF TONY\nChef Tony Howe is a San Diego native, born on Camp Pendleton, who grew up experiencing the frequent travel that is typical of a military family. When his father left the military to become a long haul trucker, Tony began to discover his passion for cooking by way of preparing dinners and packing lunches for the family. Encouraged by his father to pursue this love of cooking through formal training, Tony was able to use grants and scholarships to attend the prestigious Le Cordon Bleu School of culinary arts in Pittsburgh. Entering commercial kitchens for the first time, Tony's story began as a dishwasher, before becoming one of the banquet chefs at the 700 seat members only Rivers Club in Pittsburgh. From there, Chef Howe spent time in the kitchens of Turtle Bay Resort in Oahu, HI, and eventually came under the tutelage of the immensely knowledgeable Chef Ed Matthews of One Block West, in Virginia’s Shenandoah Valley. It was during his 7 years here that Chef Howe first fell in love with the concepts of sustainability, local foraging, upcycling scrap ingredients, and building culinary community. These would become core components of Chef Howe’s culinary philosophy as his career moved forward. Inspired by his partner Rocky, Chef Howe made the decision to go vegan, a challenge for any chef, but especially for one trying to build a life and career in small-town Virginia. To solidify their commitment to vegan cuisine, Tony and Rocky uprooted their lives, and returned to San Diego, one of the country’s epicenters for vegan culinary innovation. Here, they met Chef Roy Elam of Donna Jean, someone with a unique culinary vision for the future of vegan cuisine, and together they began a 5 year journey to create something new and inspiring at Donna Jean."
      }
    },
    "why_shoose_us_wkdQMe": {
      "type": "why-shoose-us-",
      "blocks": {
        "feature_pMQiBH": {
          "type": "feature",
          "settings": {
            "icon": "",
            "title": "Artisanal Vegan Cheeses",
            "desc": "Hand-crafted plant-based cheeses that melt, stretch, and satisfy like traditional favorites."
          }
        },
        "feature_wwaiPF": {
          "type": "feature",
          "settings": {
            "icon": "",
            "title": "Sustainable & Waste-Free",
            "desc": "We upcycle “ugly” produce and kitchen scraps to reduce food waste and support a healthier planet."
          }
        },
        "feature_eJphXB": {
          "type": "feature",
          "settings": {
            "icon": "",
            "title": "Local Collaboration",
            "desc": "Partnering with SoCal farms, restaurants, and vegan innovators to strengthen our community."
          }
        },
        "feature_DXxXjj": {
          "type": "feature",
          "settings": {
            "icon": "",
            "title": "Charcuterie Reimagined",
            "desc": "From creamy spreads to smoky cuts, we bring the full charcuterie experience—100% vegan."
          }
        }
      },
      "block_order": [
        "feature_pMQiBH",
        "feature_wwaiPF",
        "feature_eJphXB",
        "feature_DXxXjj"
      ],
      "name": "Why Choose Us",
      "settings": {
        "subheading": "Why Choose Us",
        "heading": "Why Choose Scratch House",
        "text": "Born from a chef’s passion for inventive vegan cuisine, Scratch House transforms overlooked ingredients into elevated, sustainable delights."
      }
    }
  },
  "order": [
    "main",
    "about_video_section_zCCfTg",
    "split_section_BUjQjr",
    "split_section_reversed_jyJear",
    "why_shoose_us_wkdQMe"
  ]
}
